Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་བརྩོན་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན། འདི་ལྟར་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བཟོད་པ་དང་ལྡན་ཞིང་དང་དུ་ལེན་པའི་ངང་ཚུལ་ཅན་ཡིན་པས། གྲང་བ་དང་། ཚ་བ་དང་། བཀྲེས་པ་དང་། སྐོམ་པ་དང་། རླུང་དང་། ཉི་མ་དང་། སྦྲང་བུ་དང་། ཤ་སྦྲང་དང་། སྡིག་སྦྲུལ་གྱིས་རེག་པ་དང་། ངན་དུ་སྨྲ་བ་དང་། ངན་དུ་བརྗོད་པའི་ཚིག་གི་ལམ་ལ་བཟོད་པ་དང་ལྡན་པ་ཡིན་ནོ། ། ལུས་ལས་ཚོར་བ་བྱུང་ཞིང་སྐྱེས་པ་སྡུག་བསྔལ་བ་ཤིན་ཏུ་དྲག་པོ་དང་། རྩུབ་པ་དང་། ཚ་བ་དང་། སྲོག་འཕྲོག་པ་དང་། འཆི་བ་ལ་ཐུག་པའི་ཚོར་བ་རྣམས་བཟོད་པ་དང་ཞིང་དང་དུ་ལེན་པའི་ངང་ཚུལ་ཅན་ཡིན་ནོ། །
en: “Now, Śāriputra, what is the bodhisatva’s perfection of patient acceptance, by which he wholeheartedly practices the way of the bodhisatva? Śāriputra, the bodhisatva’s patience comes from a natural ability for endurance. He can patiently accept cold and heat, starvation and thirst, wind and scorching heat, insects and reptiles, and people speaking to him in unpleasant and unwelcome ways. He is patient with painful sensations that are related to or produced by the physical body and endures them easily, whether they are intense, strong, sharp, life threatening, or deadly.

source: ཤཱ་རིའི་བུ་ང་མངོན་པར་རྫོགས་པའི་སངས་མ་རྒྱས་པ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། ཡུན་རིང་པོར་བཟོད་པ་བསྒོམས་སོ། །
en: “Previously, Śāriputra, when I had not yet attained complete awakening and was practicing the way of the bodhisatva, I cultivated patience.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟར་བཟོད་པ་སྒོམ་པར་བགྱིད།
en: Śāriputra inquired, “How then, Lord, did you cultivate patience as a bodhisatva?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ངས་མངོན་པར་ཤེས་པ་འདས་པའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སེམས་ཅན་དག་འོངས་ནས་གཤེ་རྒྱ་ཞིང་ཚིག་ངན་པ་དང་། ངག་རྩུབ་པོའི་ཚིག་སྨྲ་བ་དེ་ལ་ཤཱ་རིའི་བུ་ང་ཁྲོ་བ་དང་། ཞེ་སྡང་བ་དང་། གཏི་མུག་དང་། སེར་སྣས་ཡོངས་སུ་གདུང་བ་མ་སྐྱེས་སོ། ། དེ་ལྟར་འཁོར་བར་ཞུགས་པ་ན་འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བ་ལྟར་རྙེད་པར་སླ་བ་གང་ཡང་མེད་མོད་ཀྱི། དེ་ལ་བདག་གིས་བཏང་སྙོམས་སུ་བྱ། དེ་ལ་སྙིང་རྗེ་བསྐྱེད་པར་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཇི་ལྟར་གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བ་ལ་ཕལ་ཆེར་རབ་ཏུ་གནས་པ་དེ་དག་ལས་དེ་འདྲ་བའི་རྣམ་པར་སྨིན་པ་མངོན་པར་འགྲུབ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བ་རྙེད་པར་འགྱུར་རོ། ། གང་དང་གང་དུ་སྐྱེས་པ་ཐམས་ཅད་དུ་གཟུགས་ངན་པ་དང་། མི་སྡུག་པའི་ལུས་རབ་ཏུ་འཐོབ་བོ། །ང་ནི་གཟུགས་ངན་པར་མི་འདོད། གཤེ་བ་དང་། མི་སྙན་པ་ཟེར་བ་མི་འདོད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བ་དེ་དག་ནི་མི་རིགས་པའོ། ། དེ་དག་ནི་མི་རིགས་པའི་ལས་སོ། ། དེ་དག་ནི་བྱིས་པའི་ལས་སོ། ། དེ་དག་ནི་དམན་པའི་ལས་སོ། ། དེ་དག་ནི་སྐྱེས་བུ་དམ་པ་མ་ཡིན་པའི་ལས་སོ། ། དེ་དག་ནི་མི་བགྲུངས་པའི་ལས་སོ། ། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བར་ལྟུང་བའོ། ། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ལྟུང་བའོ། ། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བའི་གཡོག་བྱེད་པའོ། ། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་ནི་གནོད་སྦྱིན་དབུལ་པོར་བྱེད་པའོ། ། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་ནི་གནོད་སྦྱིན་དབུལ་པོར་བྱེད་པའི་རྩ་བའོ། ། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་ནི་ཡི་དགས་དབུལ་པོར་བྱེད་པ་དང་། ཡི་དགས་དབུལ་པོར་བྱེད་པའི་རྩ་བའོ། ། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་ནི་མི་དབུལ་པོར་བྱེད་པ་དང་། མི་དབུལ་པོར་བྱེད་པའི་རྩ་བའོ། ། འདི་ལྟ་སྟེ། གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་ཆོས་དེ་ལྟ་བུ་དེ་དག་ནི་དམན་པའི་འགྲོ་བར་བྱེད་པ་དང་། དམན་པའི་འགྲོ་བར་བྱེད་པའི་རྩ་བ་སྟེ། ང་ནི་དམན་པའི་འགྲོ་བ་མི་འདོད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ངེད་རིགས་པ་དང་། དེ་དག་མི་རིགས་པར་ཡང་ཁྱད་པར་ཅི་ཞིག་ཡོད། བྱེ་བྲག་ཅི་ཞིག་ཡོད་པར་འགྱུར། ཤཱ་རིའི་བུ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ངའི་རྗེས་སུ་སློབ་པའི་རང་བཞིན་ཅན་དུ་འགྱུར་བར་བྱའོ། །
en: The Lord replied, “I recall, Śāriputra, that in a past existence, when I was practicing the way of the bodhisatva and encountered sentient beings who spoke to me harshly and abusively out of anger, speaking harsh and slanderous words, because I was a bodhisatva no anger, hatred, confusion, miserliness, or distress arose in me. As I stand here in the midst of cyclic existence, there would be nothing so easy to resort to as anger and speaking in harsh ways. This is why we should cultivate equanimity. In such encounters we should cultivate compassion. Why is this? The more one displays anger and speaks in harsh ways, the more one will experience the ripening of the fruits of these actions. One will receive anger and harsh words in return. Wherever one is reborn, one will be ugly and disfigured. I do not wish to be ugly. I do not wish to be angry and speak in harsh ways. Why is this? It is because these things are improper. These are improper ways of acting. They are immature actions. They are small-minded actions. They are not the actions of good men. They are actions that bring unwanted results. With anger and harsh words one falls into the hell realms; one falls into the realms of animals. This is the nature of actions such as anger and speaking harsh words. One falls into the spirit world governed by Yama. This is the nature of actions such as anger and speaking harsh words. One becomes enslaved in hell. This is the nature of actions such as anger and speaking harsh words. One becomes an impoverished yakṣa. This is the nature of actions such as anger and speaking harsh words. Such actions are the root cause of the poverty of a yakṣa. This is the nature of actions such as anger and speaking harsh words. One becomes an impoverished preta. This is the nature of actions such as anger and speaking harsh words. Such actions are the root cause of the poverty of a preta. This is the nature of actions such as anger and speaking harsh words. One becomes an impoverished human being. This is the nature of actions such as anger and speaking harsh words. Such actions are the root cause of the poverty of a human being. This is the nature of actions such as anger and speaking harsh words. One will become a small-minded being. Such actions are the root cause of becoming a small-minded being. This is the nature of actions such as anger and speaking harsh words. We do not wish to become small-minded beings.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་གཞན་གཤེའམ། མི་སྙན་པར་ཟེར་ན། འདི་ལྟ་བུའི་ཆོས་ཡིད་ལ་བྱས་ན་བཟོད་པར་འགྱུར་ཏེ། གང་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། གསེར་དང་། དངུལ་གྱིས་ཡོངས་སུ་བཀང་སྟེ་ བྱིན་པ་བས་བཟོད་པས་བསྒྲུབས་པའི་དགེ་བའི་རྩ་བ་ཆེས་མང་དུ་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤཱ་རིའི་བུ་སྐྱེས་བུ་དམ་པས་ནན་ཏན་གྱིས་སྒྲུབ་པར་བྱེད། བཟོད་པས་སྟོབས་ཤེས་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་སེམས་ཅན་ཕལ་ཆེར་ནི་གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའི་དབང་དུ་སོང་བས་འཁོར་བ་ལས་མི་ལྡོག་གོ །
en: “What then? How can we distinguish between what is proper and improper and see what their different features are? In order to do this, Śāriputra, a bodhisatva, a great being, should cultivate himself by following the same training I followed. How is this to be done? Śāriputra, when the bodhisatva is abused and spoken to harshly by another, he keeps these sorts of instructions in mind and patiently accepts the abuse. The roots of virtue that one obtains from mastering the practice of patience in this way is much greater than those that would come from making an offering of as much money, coins, jewels, pearls, lapis lazuli, shells, coral, gold and silver as could fill the four continents of the world. Why is this? Śāriputra, an honorable man progresses successfully and displays the power of patience. It is usually the case, Śāriputra, that sentient beings who allow themselves to be governed by anger and harsh words will not be able to turn away from cyclic existence.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཅི་བདག་ལ་ཕ་རོལ་གཤེ་བའམ། མི་སྙན་པར་ཟེར་ན་ སངས་རྒྱས་དང་། བྱང་ཆུབ་དང་། ཆོས་དང་། དགེ་འདུན་ཡིད་ལ་བྱེད་དམ་ཞེས་བདག་གི་མཐུ་ཤེས་པར་བྱ་སྟེ གལ་ཏེ་ཡིད་ལ་བྱེད་ན་ལེགས། ཡིད་ལ་མི་བྱེད་པར་གྱུར་ན་དེས་རྣམ་གྲངས་དུ་མར་སངས་རྒྱས་སམ། བྱང་ཆུབ་བམ། ཆོས་སམ། དགེ་འདུན་ཡིད་ལ་བྱའོ། །ཡིད་ལ་མི་བྱེད་ན་དེ་དག་ཀྱང་གནོད་སེམས་དང་ལྡན་པ། སངས་རྒྱས་དང་། བྱང་ཆུབ་དང་། ཆོས་དང་། དགེ་འདུན་ཡིད་ལ་མི་བྱེད། བདག་ཀྱང་ཡིད་ལ་མི་བྱེད་ན། བདག་དང་། སེམས་ཅན་དེ་དག་ཏུ་ཁྱད་པར་ཅི་ཞིག་ཡོད། ཐ་དད་པ་ཅི་ཞིག་ཡོད། དཀའ་བ་སྤྱོད་པ་ཅི་ཞིག་ཡོད་ཀྱིས་དེ་དག་དང་བདག་ཅག་གནོད་སེམས་ཀྱི་དུས་ན་བཏང་སྙོམས་སུ་བྱ་བ་དང་། སངས་རྒྱས་དང་། བྱང་ཆུབ་དང་། ཆོས་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བཟོད་པའི་སྟོབས་ཀྱང་གོ་བར་བྱ་བའི་རིགས་སོ་ཞེས་བདག་ལ་བསྐུལ་བར་བྱའོ། །
en: “Furthermore, Śāriputra, the bodhisatva should be aware of his own resilience, ‘Am I able to keep the Buddha, awakening, the Dharma, and the Saṅgha in mind when I am abused and spoken to harshly by others? If I am, that will be a good thing. If I am not, I should employ various means to keep the Buddha, awakening, the Dharma or the Saṅgha in mind. When I am not able to keep them in mind, I should reflect in the following way, “What is the difference between myself and these sentient beings? As they are filled with malice, they are not able to keep the Buddha, awakening, the Dharma, and the Saṅgha in mind, just as I am not able to keep them in mind. What, then, is the difference? What is the distinction? Why is this so difficult?” On this basis, both we and they should come to the following conclusion: that when malice arises, we should react with equanimity, and in these contexts we should keep the Buddha, awakening, the Dharma, and the Saṅgha in mind. Then we will come to know the power of patience.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བདག་ནི་སེམས་ཅན་གཅིག་བཟུང་ལ་སེམས་ཅན་ཐམས་ཅད་བཏང་བ་མ་ཡིན་གྱི། བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་བསྟན་པར་བྱའོ་ཞེས་དེ་ལྟ་བུའི་ཚིག་སྨྲས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་བདག་ལ་རིགས་ཀྱི་བུ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་སྟོན་པར་མཁྱེན་ཏོ། ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་གཟིགས་པ། ཆགས་པ་མེད་པ། ཐོགས་པ་མེད་པས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་མཁྱེན་ཏེ། གལ་ཏེ་བདག་གནོད་སེམས་ཀྱི་དུས་ན་བཏང་སྙོམས་སུ་མ་གྱུར་ཅིང་གང་སངས་རྒྱས་དང་། བྱང་ཆུབ་དང་། ཆོས་དང་། དགེ་འདུན་ཡིད་ལ་མི་བྱེད་ན་དེ་ནི་བདག་གི་མི་ཆའོ། །
en: “ ‘How will we come to know this? We will not abandon any of all sentient beings on account of focusing on one single being, but we will declare, “I will realize unsurpassed perfect awakening so that I can teach the Dharma to all sentient beings. Let the lords, the buddhas, be my witness, that I, a son of good family, will work toward unsurpassed perfect awakening so that I can teach the Dharma to sentient beings. The knowledge and insight of the lords, the buddhas, is unimpeded and unobstructed, so let the lords, the buddhas, be my witness that I may never fail to meet malice with equanimity and never fail to keep the Buddha, awakening, the Dharma, and the Saṅgha in mind.

source: ཤར་ཕྱོགས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་གང་ད་ལྟར་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཀྱང་རིགས་ཀྱི་བུ་དེས་འདི་ལྟར་སེམས་སྐྱེད་དེ། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་བསྟན་པར་བྱའོ་སྙམ་དུ་བདག་གི་སེམས་བསྐྱེད་པ་མཁྱེན་ཏོ། །
en: “ ‘ “To the east reside as many tathāgatas, arhats, and perfectly awakened buddhas as there are grains of sand in the river Ganges. The lords, the buddhas, who live there, who dwell there, know of my commitment. They know that this son of good family has made the commitment to attain unsurpassed perfect awakening so that he can teach the Dharma to all sentient beings.

source: ཡང་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། བྱང་ཤར་དང་། དེ་བཞིན་དུ་སྟེང་དང་། འོག་གི་ཕྱོགས་དང་། དེ་ལྟར་ཕྱོགས་དང་། ཕྱོགས་མཚམས་དང་། དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་གང་ད་ལྟར་བཞུགས་ཏེ འཚོ་ཞིང་གཞེས་པ་དེ་དག་གིས་ཀྱང་རིགས་ཀྱི་བུ་འདི་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་སོ་ཞེས་བདག་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་སྟོན་ཅིང་བཟོད་པའི་བསྔགས་པ་བརྗོད་པར་བྱའོ་ཞེས་སེམས་བསྐྱེད་པ་དེ་མཁྱེན་གྱིས་དེ་བས་ན་སེང་གེའི་སྒྲ་བསྒྲགས་ལ་བདག་ཝའི་སྒྲ་སྒྲོག་པར་ནི་མི་བྱའོ། ། ཀྱེ་མའོ་འདི་ལྟ་སྟེ། སེང་གེའི་སྒྲ་དེ་ནི་བཟོད་པའི་སྟོབས་ཤེས་པར་བྱེད་པའོ། ། ཀྱེ་མའོ་འདི་ལྟ་སྟེ། ཝའི་སྒྲ་དེ་ནི་གཤེ་བ་དང་། མི་སྙན་པར་ཟེར་བའོ། །
en: “ ‘ “Furthermore, to the south, to the west and to the north, and to the southeast, the southwest, the northwest and the northeast, as well as above and below and in the intermediate directions, in all ten directions, there reside as many tathāgata, arhat, perfectly awakened buddhas as there would be grains of sand in as many Ganges rivers as there are grains of sand in the river Ganges. Living there, dwelling there, they know of my commitment. They know that this son of good family has made the commitment to work toward unsurpassed perfect awakening. I will attain unsurpassed perfect awakening so that I can teach the Dharma to all sentient beings and so that I can praise patience. We will praise it with the roar of the lion, and not with the bark of the jackal. It is truly with the lion’s roar that we will make the power of patience known. The bark of the jackal is for anger and verbal abuse.

source: སེམས་ཅན་འདི་དག་ནི་སེམས་ཅན་གང་དོན་བྱེད་ན་སེམས་ཅན་དེ་ཡང་དེའི་དོན་བྱེད་དོ། ། བདག་ཀྱང་སེམས་ཅན་གང་གིས་དོན་བྱས་པ་དེའི་ཕྱིར་དེའི་དོན་བྱེད་པར་གྱུར་ན་དེ་ལ་ཁྱད་པར་ཅི་ཞིག་ཡོད། ཐ་དད་པ་ཅི་ཞིག་ཡོད། དཀའ་བ་སྤྱོད་པ་ཅི་ཞིག་ཡོད། སེམས་ཅན་འདི་དག་ནི་སེམས་ཅན་གང་གནོད་པར་བྱེད་ན་དེ་ལ་སེམས་ཅན་དེ་ཡང་གནོད་པར་བྱེད་དོ། །
en: “ ‘ “Sentient beings help those who help them. If I were to help those who help me, then what would be the difference between us? What would be the difficulty in that? What would the distinction be?

source: བདག་གིས་ཀྱང་སེམས་ཅན་གང་གནོད་པར་བྱེད་ན། བདག་ཀྱང་དེ་ལ་གནོད་པར་བྱེད་དེ། གནོད་པའི་ཕྱིར། གནོད་པ་བྱེད་ན། དེ་ལ་ཁྱད་པར་ཅི་ཞིག་ཡོད། ཐ་དད་པ་ཅི་ཞིག་ཡོད། དཀའ་བ་སྤྱོད་པ་ཅི་ཞིག་ཡོད་པར་འགྱུར།
en: “ ‘ “Sentient beings are hostile to those who are hostile to them. If I were to be hostile toward those who are hostile toward me, then what would be the difference between us? What would be the difficulty in that? What would the distinction be?” ’

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སློབ་སྟེ། སེམས་ཅན་འདི་དག་ཐམས་ཅད་ནི་ཕན་ཚུན་དུ་མི་མཛའ་བ་སྟེ། དེ་དག་ནོར་ཐོབ་ན་ནི་མཛའ་བར་ཤེས། གནོད་པར་བྱས་ན་ནི་གཅིག་ལ་གཅིག་གསོད་པར་བྱེད་དོ། ། བདག་ནི་སེམས་ཅན་གྱི་དོན་ལ་ཚམ་ཚོམ་མེད་དེ། བདག་ལ་གནོད་པར་གྱུར་ཀྱང་བདག་སེམས་ཅན་གྱི་དོན་བྱའོ་སྙམ་མོ། །
en: “The bodhisatva, Śāriputra, trains in this way: ‘All these sentient beings are mutual enemies, but if they can gain an advantage by becoming friends, they will consider one another friends. They are, however, still happy to harm and kill one another. I will not be oblivious to the fortunes of sentient beings. Let harm befall me. I will still work for the benefit of sentient beings.’ ”

source: བསྐལ་པ་བྱེ་བ་མང་པོ་བརྒྱར། །བདག་ལ་གནོད་པར་གྱུར་ཀྱང་ནི། །སེམས་ཅན་སྡུག་བསྔལ་རྣམས་མཐོང་ན། །ཡལ་བར་བོར་ཞིང་མི་འདུག་གོ །
en: “Let misfortune befall me For many thousands of millions of eons. Still, I will not stand by with indifference, Watching sentient beings suffer.

source: དོན་རྙེད་ན་ནི་མཛའ་བོ་ཤེས། །ཕན་ཚུན་གཅིག་ལ་གཅིག་སྨྲ་ཡི། །དོན་རྣམས་བྱེད་པར་མི་འགྱུར་ན། །
en: “If it benefits them, They will consider one another friends.

source: ཕན་ཚུན་དུ་ནི་གནོད་པར་བྱེད། །ང་དང་རྟག་ཏུ་མཛའ་བྱ་ཞེས། །
en: If they are not able to find any advantage in friendship, They will hurt one another instead.

source: འཛམ་བུའི་གླིང་འདི་ཐམས་ཅད་དང་། །སངས་རྒྱས་ཞིང་རྣམས་རིན་པོ་ཆེ། །འབའ་ཞིག་བཀང་སྟེ་སྦྱིན་བྱེད་དང་། །གང་དག་མཚོན་ནི་རྣོན་པོ་ཡིས། །
en: “I will always remain friendly And give away enough wealth To fill the whole of the world And the realms of the buddhas.

source: ཡན་ལག་ཉིང་ལག་གཅོད་པ་ཡི། །སེམས་ཅན་རྣམས་ནི་ཐམས་ཅད་ལ། །མཉམ་པ་ཡི་ནི་སེམས་སུ་བྱ། །གཤེ་དང་མི་སྙན་ཟེར་བ་དང་། །ངན་དུ་བྱས་པ་ཐམས་ཅད་བཟོད། །
en: “Let me be tortured, And let the limbs of my body be severed— Still I will remain even minded Toward all sentient beings. “They tolerate anger and verbal abuse And all kinds of evil acts.

source: བཟོད་པ་ལ་ནི་རབ་གནས་ནས། །བཟོད་པ་དག་གི་བསྔགས་པ་བརྗོད། །
en: Their patience is firm. They praise patience.

source: དུག་ལྡུད་མཚོན་གྱིས་འདེབས་པ་ཡི། །གཅིག་ལ་གཅིག་ནི་གནོད་བྱེད་པ། །སེམས་ཅན་དེ་དག་བསྡུམ་པར་བྱ། ། དེ་ནི་མཁས་པའི་མཚན་ཉིད་དོ། །
en: “It is a characteristic of the learned ones That they are able to reconcile sentient beings Who hurt one another With weapons and poison.

source: བྱིས་པ་སྤྱོད་པ་འང་གཞན་ཡིན་ཏེ། གང་གིས་མྱ་ངན་འདའ་བའང་གཞན། །བདག་ནི་ཁྱད་པར་ཚོལ་བས་ན། །བྱིས་པ་དག་ནི་བདག་མི་སློབ། །
en: “I will not follow the training of the immature But rather seek that which is exceptional, That which is different from the ways of the immature And different from the attainment of nirvāṇa.

source: ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ། གལ་ཏེ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་རྡོ་དབྱུག་དང་མཚོན་འདེབས་ཤིང་འཕེན་པས་ཡུད་ཙམ་ཡང་འཚོར་མི་སྟེར་ན། དེས་ཀྱེ་མའོ་ངོ་མཚར་ཏོ་ཞེས་བྱ་བ་ནས་སེམས་ཅན་འདི་དག་ནི་འཕགས་པ་སྟེ། བདག་གི་སྲོག་མ་བཅད་དོ་སྙམ་པའི་བར་དུ་དེ་ལྟར་བདག་གོ་བར་བྱ་ཞིང་ཡང་འདི་ལྟར་བསླབ་བོ། །ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། བརྒྱ་ལ་བདག་གོམ་པ་བདུན་བོར་བ་ཙམ་གྱི་ཡུན་ལ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་མགོ་བཅད་པར་གྱུར་ཀྱང་བདག་ཁྲོ་བ་དང་། གཤེ་བ་བསྒོམ་པར་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཁོང་ཁྲོ་བ་ཁོང་ཁྲོ་བ་ཞེས་བྱ་བ་ནི་བསྐལ་པ་བརྒྱ་སྟོང་དུ་བསྒྲུབས་པའི་དགེ་བའི་རྩ་བ་འཇོམས་པ་སྟེ། ཡང་ཕྱིར་བདག་གིས་བསྐལ་པ་བརྒྱ་སྟོང་དུ་དགེ་བའི་རྩ་བ་བསྒྲུབ་པར་བྱ་དགོས་སོ། ། དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ནི་བསྒྲུབ་དཀའ་བ་ཡིན་ཏེ། དེ་ལྟར་ཆོས་དེ་འབྱུང་བར་དཀའ་བའོ། ། དེ་བས་ན་བདག་བཟོད་པའི་སྟོབས་ཀྱི་གོ་ཆ་བགོ་བར་བྱའོ། །
en: “This then, Śāriputra, is how the bodhisatva will approach the training. If someone beats him with stones, sticks, or weapons for a hundred thousand million billion eons but does not kill him, his reaction will be, ‘It is wonderful that these noble sentient beings do not rob me of my life.’ Furthermore, he will approach the training in this way: ‘Even if they were to chop off my head as many times as there are grains of sand in the river Ganges before I could take the first seven steps, I would still not become annoyed or angry. Why is this? Anger, that which is called anger, destroys the roots of virtue that have been accumulated over a hundred thousand eons. Then, I would have to accumulate roots of virtue for another hundred thousand eons, and unsurpassed perfect awakening would be that much harder to achieve. It would be that much harder to meet with the Dharma. Therefore, we must don the armor that is the power of patient acceptance.’

source: དེ་ལྟར་ཤཱ་རིའི་བུ་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་སེམས་སྡང་བར་གྱུར་པ་ལ་བདུད་ཀྱིས་གླགས་རྙེད་དོ། །གླགས་རྙེད་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་གཅོད་པར་འགྱུར་རོ། །སེམས་སྡང་བས་ནི་བྱང་ཆུབ་ཏུ་བྱ་བ་ལ་གཡེང་བར་འགྱུར་རོ། །སེམས་གཡེངས་པ་ལ་ནི་བདུད་སྡིག་ཅན་བདུད་ཀྱི་ལས་ཀྱིས་སྐུལ་བར་བྱེད་དོ། །དེ་ལ་བདུད་ཀྱི་ལས་གང་ཞེ་ན།འདི་ལྟ་སྟེ། ལྷུང་བཟེད་ལ་ཞུགས་པའི་སེམས་ནི་བདུད་ཀྱི་ལས་སོ། །ཆོས་གོས་ལ་ཞུགས་པའི་སེམས་ནི་བདུད་ཀྱི་ལས་སོ། །གྲོང་དུ་སློང་བ་ལ་ཞུགས་པའི་སེམས་ནི་བདུད་ཀྱི་ལས་སོ། །རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་ཞུགས་པའི་སེམས་ནི་བདུད་ཀྱི་ལས་སོ། །རབ་ཏུ་འབྱུང་བ་ལས་འདུན་པ་ཟློག་པ་ནི་བདུད་ཀྱི་ལས་སོ། །ཆོས་དཀར་པོ་མང་པོ་ལས་འདུན་པ་ཟློག་པ་ནི་བདུད་ཀྱི་ལས་སོ། །དགོན་པར་གནས་པ་ལས་མོས་པ་ཟློག་པ་ནི་བདུད་ཀྱི་ལས་སོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་འདུན་པ་ཟློག་པ་ནི་བདུད་ཀྱི་ལས་སོ། །ཡེ་ཤེས་གཞན་འདོད་པ་ནི་བདུད་ཀྱི་ལས་སོ། །མཁན་པོ་དང་སློབ་དཔོན་ལ་སྲི་ཞུ་མི་བྱེད་པ་ནི་བདུད་ཀྱི་ལས་སོ། །དེ་ལྟར་ཤཱ་རིའི་བུ་སེམས་སྡང་བ་ལ་ནི་བྱང་ཆུབ་ཏུ་བྱ་བ་ལ་གཡེང་བར་འགྱུར་རོ། །སེམས་གཡེང་བ་ནི་བདུད་སྡིག་ཅན་བདུད་ཀྱི་ལས་འདི་དག་ལ་འཛུད་དོ། །ཤཱ་རིའི་བུ་བདུད་སྡིག་ཅན་ཡུན་རིང་པོ་ནས་གླགས་ཚོལ་ཏེ། འདི་ལྟ་སྟེ། ཁྲོ་བ་དང་། གནོད་སེམས་ཚོལ་མོད་ཀྱི།
en: “Śāriputra, Māra will surely appear to the Mahāyāna practitioner who is aggressive and create obstacles to the attainment of unsurpassed perfect awakening. Someone who is aggressive will lose his focus on awakening, and with a scattered mind, he will be vulnerable to evil Māra’s demonic ways. What are the demonic ways of Māra? They are to have a demonic attitude toward the begging bowl, to have a demonic attitude toward the monastic robes, to have a demonic attitude toward begging for alms, to relate to success, honor, and praise in a demonic manner, the demonic attitude of being disinclined to become a renunciant, the demonic attitude of being disinclined to act in beneficial ways, the demonic attitude of being disinclined to remain in retreat, the demonic attitude of being disinclined to attain unsurpassed perfect awakening, and the demonic attitude of heedlessness toward preceptors and teachers. Śāriputra, one who is aggressive will lose his focus on awakening, and when his mind is scattered, Śāriputra, the evil Māra will lead him in the direction of these demonic ways. Śāriputra, the evil Māra looks for his weak points for a long time. He searches for anger and aggression.

source: ཤཱ་རིའི་བུ་ངས་མངོན་པར་ཤེས་པ་འདས་པའི་དུས་ན་ང་སྤྱོད་པའི་སྤྱོད་ཡུལ་ཞེས་བྱ་བའི་དྲང་སྲོང་དུ་གྱུར་ཏེ། དེ་ན་ང་ལ་བདུད་སྡིག་ཅན་གྱིས་སྐྱེས་བུ་ལྔ་བརྒྱ་གཤེ་བ་ལ་དཔའ་བ་མངོན་པར་སྤྲུལ་ནས་དེ་དག་ལོ་ལྔ་བརྒྱའི་བར་དུ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ངའི་ཕྱི་བཞིན་ཐོག་ཐག་ཏུ་འབྲང་ཞིང་དེ་དག་མཚན་ཡང་གཤེ། ཉིན་ཡང་གཤེ། འགྲོ་ཡང་གཤེ། འོང་ཡང་གཤེ། འགྲེང་ཡང་གཤེ། འདུག་ཀྱང་གཤེ། ཉལ་བ་དང་། འཆག་པ་དང་། འདུག་པ་དང་། གྲོང་དུ་འགྲོ་བ་དང་། སྲང་ན་འགྲེང་བ་དང་། ཁྱིམ་ན་འགྲེང་བ་དང་། སྲང་ན་འདུག་པ་དང་། ཁྱིམ་ན་འདུག་པ་དང་། དགོན་པར་སོང་བ་དང་། དགོན་པར་འགྲེང་བ་དང་། དགོན་པར་འདུག་ཀྱང་གཤེ་ཞིང་མི་སྙན་པ་ཟེར་ཏེ ངན་དུ་སྨྲ་ཚིག་རྩུབ་པོ་སྨྲ་ཞིང་ཐབས་དེ་ལྟ་བུར་གནས་ཏེ། དེ་དག་ལོ་ལྔ་བརྒྱའི་བར་དུ་ཕྱི་བཞིན་ཐོག་ཐག་ཏུ་འབྲངས་པར་གྱུར་ཏེ། འོན་ཀྱང་ཤཱ་རིའི་བུ་ལོ་ལྔ་བརྒྱར་གཤེ་བ་ལ་དཔའ་བའི་སྐྱེས་བུ་དེ་དག་ལ་བྱམས་པ་ཉེ་བར་སྦྱོར་བས་ལྟ་བ་ལས་གཞན་ཐ་བའི་ཉེས་པ་སྐྱེད་པའི་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་ཡང་མི་ཤེས་སོ། །
en: “Śāriputra, I recall a certain occasion in the past when I was a seer by the name of Cāritragocara, and the evil Māra produced five hundred aggressive and powerful men. They hounded me continually for five hundred years. They abused me at night. They abused me during the day. They abused me when I was leaving. They abused me when I was coming. They abused me when I was standing and sitting. They abused me when I was sleeping. They abused me when I was walking. They abused and verbally attacked me when I was resting, when I was in the village, when I was traveling, when I was at home, when I was resting on the road, when I was resting at home, when I was going on retreat, when I was staying in retreat, and when I was resting in retreat. They spoke evil and harsh words to me in these various situations, hounding me continually for five hundred years. Still, Śāriputra, I recall that throughout these five hundred years, not only was it not an option for me to have any antipathy toward them, but I would look upon them with an attitude of love.
